package 大华技术股份;

/**
 * 圣诞老人送礼物
 * 圣诞节快到了，圣诞老人准备了一堆礼物赶往小镇，再穿过前方一个森林就可以到达小镇了。
 * 不过森林的道路并不平坦，路上有很多陷阱，圣诞老人必须扔下一些礼物埋掉陷阱才能穿过。
 * 幸好圣诞老人在出发前准备好了地图，请帮助圣诞老人保留最多的礼物并尽快到达小镇。
 * <p>
 * 输入：
 * 第一行包含两个正整数，n m（n < 100000000, m <= 100）
 * n表示礼物的数量
 * m表示森林的宽高（森林是边长为m的正方形）
 * 接下来m行，每行m个字符，表示森林的地图
 * 其中*表示有障碍物不能通行
 * 0表示可以正常通行
 * B在左上角表示起点
 * E在右下角表示目的地小镇
 * 1-9表示陷阱，需要消耗1-9个礼物才能通过
 * 0-9的位置可以通行，且只能向上下左右四个方向，每走一格需要消耗一个单位时间。
 * 输出：
 * 输出两个正整数，礼物最多剩余数量和剩余最多的情况需要消耗的最短时间。
 * (测试数据中，圣诞老人一定能达到小镇，且一定有礼物剩余)
 * <p>
 * 输入：
 * 1000 8
 * B0000***
 * 0***0***
 * 0***0***
 * 0*000000
 * 0*3*9**2
 * 0*000000
 * 9***1***
 * 0000000E
 * 输出：
 * 997 20
 */
public class Main5 {
    public static void main(String[] args) {

    }
}
