package 大华技术股份;

/**
 * 队伍排列
 * 春天到了，又到了踏青时节，小明一组8人决定去林园游玩。路上发现队伍乱糟糟的，小明决定整顿队伍，
 * 且整顿时，总是两两交换人员(注意可以跨过其他人进行两两交换)。已知当前队伍序列N，
 * 目标序列总是为A0 A1 A2 ... A7。问最少经过多少次交换即可达成目标？
 * <p>
 * 输入：
 * 第一行：用例数量
 * 剩余行：每行表示一个用例，表示N序列
 * 输出：
 * 最少交换次数
 * <p>
 * 样例
 * 输入：
 * 2
 * A7 A1 A2 A3 A4 A5 A6 A0
 * A0 A2 A1 A4 A3 A5 A6 A7
 * 输出：
 * 1
 * 2
 * <p>
 * 提示：
 * 2
 * A7 A1 A2 A3 A4 A5 A6 A0
 * A0 A2 A1 A4 A3 A5 A6 A7
 * 用例1  A7和A0交换即可，1次交换即可
 * 用例2  A2和A1交换，A4和A3交换，2次交换即可
 */
public class Main4 {
    public static void main(String[] args) {

    }
}
